public/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>German Martinez's Tech Blog</title>
<meta name="author" content="German Martinez" />
<meta name="description" content="Welcome to my blog! Here, you'll find articles on machine learning, web development, software development knowledge, and mathematics." />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='./styles/simple.css' />
</head>
<body>
<div id="content" class="content">
<h1 class="title">German Martinez's Tech Blog</h1>

<div id="outline-container-orgd170c74" class="outline-2">
<h2 id="orgd170c74">Table of Contents</h2>
<div class="outline-text-2" id="text-orgd170c74">
<p>
(Currently outlines)
</p>
</div>

<div id="outline-container-org2972c87" class="outline-3">
<h3 id="org2972c87">General Software Development</h3>
<div class="outline-text-3" id="text-org2972c87">
<ul class="org-ul">
<li><a href="./software-dev/algorithm-design-patterns.html">Algorithm Design Patterns</a></li>
<li><a href="./software-dev/version-control-best-practices.html">Version Control Best Practices</a></li>
<li><a href="./software-dev/debugging-tips-tricks.html">Debugging Tips and Tricks</a></li>
<li><a href="./software-dev/code-review-guidelines.html">Code Review Guidelines</a></li>
</ul>
</div>
</div>

<div id="outline-container-org60d25eb" class="outline-3">
<h3 id="org60d25eb">Web Development</h3>
<div class="outline-text-3" id="text-org60d25eb">
<ul class="org-ul">
<li><a href="./web-development/sveltekit-crash-course.html">SvelteKit: A Crash Course</a></li>
<li><a href="./web-development/css-styling-tips.html">Styling Tips</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf8d8721" class="outline-3">
<h3 id="orgf8d8721">Machine Learning</h3>
<div class="outline-text-3" id="text-orgf8d8721">
<ul class="org-ul">
<li><a href="./machine-learning/intro-to-ml.html">Introduction to Machine Learning</a></li>
<li><a href="./machine-learning/deep-learning-basics.html">Deep Learning Basics</a></li>
</ul>
</div>
</div>

<div id="outline-container-org6f7984a" class="outline-3">
<h3 id="org6f7984a">Mathematics</h3>
<div class="outline-text-3" id="text-org6f7984a">
<ul class="org-ul">
<li><a href="./math/linear-algebra-basics.html">Linear Algebra Basics</a></li>
<li><a href="./math/calculus-fundamentals.html">Calculus Fundamentals</a></li>
<li><a href="./math/probability-statistics-intro.html">Probability and Statistics: An Introduction</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgcccdcd4" class="outline-2">
<h2 id="orgcccdcd4">About Me</h2>
<div class="outline-text-2" id="text-orgcccdcd4">
<ul class="org-ul">
<li>Hi! I'm German Martinez, a passionate software developer with a keen interest in machine learning and web development. I created this blog as a place to share my knowledge and experiences in the tech world. Feel free to reach out if you have any questions or suggestions!</li>
</ul>
</div>
</div>

<div id="outline-container-orgac33014" class="outline-2">
<h2 id="orgac33014">Contact</h2>
<div class="outline-text-2" id="text-orgac33014">
<ul class="org-ul">
<li>You can contact me at: <a href="mailto:german.martinez@example.com">german.martinez@gmail.com</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: German Martinez</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6)</p>
</div>
</body>
</html>